In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
movies = pd.read_csv("Data/movies.dat", sep="::", header=None, names=["title", "genre"])

C:\Users\chittithalli\AppData\Local\Temp\ipykernel_24988\2634951409.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies = pd.read_csv("Data/movies.dat", sep="::", header=None, names=["title", "genre"])

In [4]:
movies.head()

                                               title  genre
0                   ;title;genre;movieId;imdbId;year    NaN
1  1;Toy Story ;Animation|Children's|Comedy;1;114...    NaN
2  2;Jumanji ;Adventure|Children's|Fantasy;2;1134...    NaN
3   3;Grumpier Old Men ;Comedy|Romance;3;113228;1995    NaN
4    4;Waiting to Exhale ;Comedy|Drama;4;114885;1995    NaN

In [5]:
movies.tail()

                                                  title  genre
3879     3948;Meet the Parents ;Comedy;3948;212338;2000    NaN
3880   3949;Requiem for a Dream ;Drama;3949;180093;2000    NaN
3881             3950;Tigerland ;Drama;3950;170691;2000    NaN
3882      3951;Two Family House ;Drama;3951;202641;2000    NaN
3883  3952;Contender, The ;Drama|Thriller;3952;20887...    NaN

In [6]:
movies["movieId"] = movies.index

In [7]:
movies.head()

                                               title  genre  movieId
0                   ;title;genre;movieId;imdbId;year    NaN        0
1  1;Toy Story ;Animation|Children's|Comedy;1;114...    NaN        1
2  2;Jumanji ;Adventure|Children's|Fantasy;2;1134...    NaN        2
3   3;Grumpier Old Men ;Comedy|Romance;3;113228;1995    NaN        3
4    4;Waiting to Exhale ;Comedy|Drama;4;114885;1995    NaN        4

In [9]:
import os
print(os.getcwd())

C:\Users\chittithalli\movrec

In [12]:
imdb_links = pd.read_csv("C:/Users/chittithalli/movrec/link.csv", usecols=["movieId", "imdbId"])

In [13]:
imdb_links.head()

   movieId  imdbId
0        1  114709
1        2  113497
2        3  113228
3        4  114885
4        5  113041

In [14]:
any(imdb_links.movieId == 3952)

True

In [15]:
imdb_links.dtypes

movieId    int64
imdbId     int64
dtype: object

In [16]:
imdb_links.imdbId = imdb_links.imdbId.apply(lambda x: "0"*(7-len(str(x)))+str(x))

In [17]:
imdb_links.dtypes

movieId     int64
imdbId     object
dtype: object

In [18]:
imdb_links.head()

   movieId   imdbId
0        1  0114709
1        2  0113497
2        3  0113228
3        4  0114885
4        5  0113041

In [19]:
test1 = movies.join(imdb_links.set_index("movieId"), how="left", on="movieId")

In [20]:
test1.head()

                                               title  genre  movieId   imdbId
0                   ;title;genre;movieId;imdbId;year    NaN        0      NaN
1  1;Toy Story ;Animation|Children's|Comedy;1;114...    NaN        1  0114709
2  2;Jumanji ;Adventure|Children's|Fantasy;2;1134...    NaN        2  0113497
3   3;Grumpier Old Men ;Comedy|Romance;3;113228;1995    NaN        3  0113228
4    4;Waiting to Exhale ;Comedy|Drama;4;114885;1995    NaN        4  0114885

In [21]:
test1.tail()

,title,genre,movieId,imdbId
3879,3948;Meet the Parents ;Comedy;3948;212338;2000,NaN,3879,0160009
3880,3949;Requiem for a Dream ;Drama;3949;180093;2000,NaN,3880,0236008
3881,3950;Tigerland ;Drama;3950;170691;2000,NaN,3881,0168515
3882,3951;Two Family House ;Drama;3951;202641;2000,NaN,3882,0204946
3883,"3952;Contender, The ;Drama|Thriller;3952;20887...",NaN,3883,0162903

In [22]:
test1[test1["imdbId"].isnull()].head()

                                                 title  genre  movieId imdbId
0                     ;title;genre;movieId;imdbId;year    NaN        0    NaN
91       92;Mary Reilly ;Drama|Thriller;92;117002;1996    NaN       91    NaN
221                 223;Clerks ;Comedy;223;109445;1994    NaN      221    NaN
323        326;To Live (Huozhe) ;Drama;326;110081;1994    NaN      323    NaN
557  560;Beans of Egypt, Maine, The ;Drama;560;1092...    NaN      557    NaN

In [23]:
test1.fillna("0", inplace=True)

C:\Users\chittithalli\AppData\Local\Temp\ipykernel_24988\3347623963.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '0' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  test1.fillna("0", inplace=True)

In [24]:
test1[test1["imdbId"].isnull()]

Empty DataFrame
Columns: [title, genre, movieId, imdbId]
Index: []

In [25]:
test1.head()

                                               title genre  movieId   imdbId
0                   ;title;genre;movieId;imdbId;year     0        0        0
1  1;Toy Story ;Animation|Children's|Comedy;1;114...     0        1  0114709
2  2;Jumanji ;Adventure|Children's|Fantasy;2;1134...     0        2  0113497
3   3;Grumpier Old Men ;Comedy|Romance;3;113228;1995     0        3  0113228
4    4;Waiting to Exhale ;Comedy|Drama;4;114885;1995     0        4  0114885

In [26]:
test1.to_csv("Data/movies.dat", sep=";", encoding="utf-8")

In [27]:
movies = pd.read_csv("Data/movies.dat", sep=";", index_col=0)
movies["year"] = movies["title"].apply(lambda x: x[-5:-1])
movies["title"] = movies["title"].apply(lambda x: x[:-6])
movies.to_csv("Data/movies.dat", sep=";", encoding="utf-8")